Revit 2027 API
VertexPositionColored.GetColor Method
 Gets the vertex's color.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ColorWithTransparency GetColor()
Public Function GetColor As ColorWithTransparency
public:
ColorWithTransparency^ GetColor()
member GetColor : unit -> ColorWithTransparency
Return Value
ColorWithTransparency
 The vertex's color.
See Also
Reference
VertexPositionColored Class
Autodesk.Revit.DB.DirectContext3D Namespace